# RailTypeChangeInconsistancyWarningWithResetBtn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RailTypeChangeInconsistancyWarningWithResetBtn Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Some rail type changes are not consistent with your rail instances customization in this project, you can reset them to make them corresponding with your changes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RailTypeChangeInconsistancyWarningWithResetBtn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RailTypeChangeInconsistancyWarningWithResetBtn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RailTypeChangeInconsistancyWarningWithResetBtn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace